comu/com.energyict.mdc.cim.webservices.outbound.soap/src/test/resources/samples/usagepointconfig/ChangeUsagePointConfigRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:usag="http://iec.ch/TC57/2011/UsagePointConfigMessage" xmlns:mes="http://iec.ch/TC57/2011/schema/message"
                  xmlns:usag1="http://iec.ch/TC57/2011/UsagePointConfig#" xmlns:cus="http://connexo.elster.com/2017/schema/customattributes">
    <soapenv:Header/>
    <soapenv:Body>
        <usag:ChangeUsagePointConfig>
            <usag:Header>
                <mes:Verb>change</mes:Verb>
                <mes:Noun>UsagePointConfig</mes:Noun>
                <mes:Timestamp>2017-07-07T15:15:00+03:00</mes:Timestamp>
                <!--You may enter ANY elements at this point-->
            </usag:Header>
            <usag:Payload>
                <usag1:UsagePointConfig>
                    <!-- Required -->
                    <usag1:UsagePoint>
                        <!-- Optional -->
                        <!-- MRID is present => identification by MRID => name can be changed -->
                        <!-- No MRID => identification by name -->
                        <!-- No MRID & name => error -->
                        <usag1:mRID>00000000-0000-0000-0000-0000000000ff</usag1:mRID>
                        <!-- Optional -->
                        <!-- Required for 'Install active/inactive' transitions -->
                        <!-- i.e. to change state from 'Under construction' to 'Active'/'Inactive' -->
                        <usag1:connectionState>connected</usag1:connectionState>
                        <!-- Optional -->
                        <!-- Ignored if ServiceCategory is not electricity -->
                        <usag1:phaseCode>s1N</usag1:phaseCode>
                        <!-- Optional -->
                        <!-- No 'Change Status' event => no transition (i.e. state change) attempted -->
                        <usag1:ConfigurationEvents>
                            <!-- Ignored -->
                            <usag1:effectiveDateTime>2017-07-07T11:11:00+03:00</usag1:effectiveDateTime>
                            <!-- Required -->
                            <usag1:reason>Change Status</usag1:reason>
                        </usag1:ConfigurationEvents>
                        <!-- Optional -->
                        <!-- MRID is present => identification by MRID => name can be changed -->
                        <!-- No MRID => identification by name -->
                        <!-- No MRID & name => error -->
                        <usag1:Names>
                            <usag1:name>U,U,D,D,L,R,L,R,A,B,SELECT,START</usag1:name>
                        </usag1:Names>
                        <!-- Required if 'Change Status' event is present -->
                        <!-- Ignored otherwise -->
                        <usag1:status>
                            <usag1:value>Inactive</usag1:value>
                        </usag1:status>
                        <!--You may enter ANY elements at this point-->
                    </usag1:UsagePoint>
                </usag1:UsagePointConfig>
            </usag:Payload>
        </usag:ChangeUsagePointConfig>
    </soapenv:Body>
</soapenv:Envelope>
